#### [`repos-official-new`] Terraform Plan 📖`success`

<a href="https://app.terraform.io/app/cdktf-team/prebuilt-providers-official-new/runs/run-J7xWxE9drVboxpue" target="_blank">Remote Plan Link ↗️</a>

<details><summary>Show Plan</summary>

```tf
[command]/home/runner/work/_temp/f9558325-0871-49a9-831d-80be120ea22f/terraform-bin plan -no-color
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/cdktf-team/prebuilt-providers-official-new/runs/run-J7xWxE9drVboxpue

Waiting for the plan to start...

Terraform v1.3.1
on linux_amd64
Initializing plugins and modules...
data.github_team.reposofficialnew_cdktfteamcdktf_4A2C9F8E: Reading...
data.github_team.reposofficialnew_cdktfteamcdktf_4A2C9F8E: Read complete after 7s [id=6602018]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # github_branch_protection.reposofficialnew_cdktfproviderad_mainprotection_874EE043 will be destroyed
  # (because github_branch_protection.reposofficialnew_cdktfproviderad_mainprotection_874EE043 is not in configuration)
  - resource "github_branch_protection" "reposofficialnew_cdktfproviderad_mainprotection_874EE043" {
      - allows_deletions       = false -> null
      - allows_force_pushes    = false -> null
      - enforce_admins         = true -> null
      - id                     = "BPR_kwDOIIyyB84Bw3VG" -> null
      - pattern                = "main" -> null
      - push_restrictions      = [] -> null
      - repository_id          = "cdktf-provider-ad" -> null
      - require_signed_commits = false -> null

      - required_status_checks {
          - contexts = [
              - "build",
              - "package-dotnet",
              - "package-go",
              - "package-java",
              - "package-js",
              - "package-python",
            ] -> null
          - strict   = true -> null
        }
    }

  # github_branch_protection.reposofficialnew_cdktfproviderad_repositorysetup_mainprotection_67975441 will be created
  + resource "github_branch_protection" "reposofficialnew_cdktfproviderad_repositorysetup_mainprotection_67975441" {
      + allows_deletions       = false
      + allows_force_pushes    = false
      + enforce_admins         = true
      + id                     = (known after apply)
      + pattern                = "main"
      + repository_id          = "cdktf-provider-ad"
      + require_signed_commits = false

      + required_status_checks {
          + contexts = [
              + "build",
              + "package-dotnet",
              + "package-go",
              + "package-java",
              + "package-js",
              + "package-python",
            ]
          + strict   = true
        }
    }

  # github_branch_protection.reposofficialnew_cdktfproviderazurestack_mainprotection_FCDC8661 will be destroyed
  # (because github_branch_protection.reposofficialnew_cdktfproviderazurestack_mainprotection_FCDC8661 is not in configuration)
  - resource "github_branch_protection" "reposofficialnew_cdktfproviderazurestack_mainprotection_FCDC8661" {
      - allows_deletions       = false -> null
      - allows_force_pushes    = false -> null
      - enforce_admins         = true -> null
      - id                     = "BPR_kwDOIIy1rc4Bw3Vt" -> null
      - pattern                = "main" -> null
      - push_restrictions      = [] -> null
      - repository_id          = "cdktf-provider-azurestack" -> null
      - require_signed_commits = false -> null

      - required_status_checks {
          - contexts = [
              - "build",
              - "package-dotnet",
              - "package-go",
              - "package-java",
              - "package-js",
              - "package-python",
            ] -> null
          - strict   = true -> null
        }
    }

  # github_branch_protection.reposofficialnew_cdktfproviderazurestack_repositorysetup_mainprotection_A3308AE9 will be created
  + resource "github_branch_protection" "reposofficialnew_cdktfproviderazurestack_repositorysetup_mainprotection_A3308AE9" {
      + allows_deletions       = false
      + allows_force_pushes    = false
      + enforce_admins         = true
      + id                     = (known after apply)
      + pattern                = "main"
      + repository_id          = "cdktf-provider-azurestack"
      + require_signed_commits = false

      + required_status_checks {
          + contexts = [
              + "build",
              + "package-dotnet",
              + "package-go",
              + "package-java",
              + "package-js",
              + "package-python",
            ]
          + strict   = true
        }
    }

  # github_branch_protection.reposofficialnew_cdktfproviderboundary_mainprotection_174B1B9C will be destroyed
  # (because github_branch_protection.reposofficialnew_cdktfproviderboundary_mainprotection_174B1B9C is not in configuration)
  - resource "github_branch_protection" "reposofficialnew_cdktfproviderboundary_mainprotection_174B1B9C" {
      - allows_deletions       = false -> null
      - allows_force_pushes    = false -> null
      - enforce_admins         = true -> null
      - id                     = "BPR_kwDOIIy5Y84Bw3Wv" -> null
      - pattern                = "main" -> null
      - push_restrictions      = [] -> null
      - repository_id          = "cdktf-provider-boundary" -> null
      - require_signed_commits = false -> null

      - required_status_checks {
          - contexts = [
              - "build",
              - "package-dotnet",
              - "package-go",
              - "package-java",
              - "package-js",
              - "package-python",
            ] -> null
          - strict   = true -> null
        }
    }

  # github_branch_protection.reposofficialnew_cdktfproviderboundary_repositorysetup_mainprotection_C6785CF1 will be created
  + resource "github_branch_protection" "reposofficialnew_cdktfproviderboundary_repositorysetup_mainprotection_C6785CF1" {
      + allows_deletions       = false
      + allows_force_pushes    = false
      + enforce_admins         = true
      + id                     = (known after apply)
      + pattern                = "main"
      + repository_id          = "cdktf-provider-boundary"
      + require_signed_commits = false

      + required_status_checks {
          + contexts = [
              + "build",
              + "package-dotnet",
              + "package-go",
              + "package-java",
              + "package-js",
              + "package-python",
            ]
          + strict   = true
        }
    }

  # github_branch_protection.reposofficialnew_cdktfproviderconsul_mainprotection_862B8BA0 will be destroyed
  # (because github_branch_protection.reposofficialnew_cdktfproviderconsul_mainprotection_862B8BA0 is not in configuration)
  - resource "github_branch_protection" "reposofficialnew_cdktfproviderconsul_mainprotection_862B8BA0" {
      - allows_deletions       = false -> null
      - allows_force_pushes    = false -> null
      - enforce_admins         = true -> null
      - id                     = "BPR_kwDOIIy2Yc4Bw3WA" -> null
      - pattern                = "main" -> null
      - push_restrictions      = [] -> null
      - repository_id          = "cdktf-provider-consul" -> null
      - require_signed_commits = false -> null

      - required_status_checks {
          - contexts = [
              - "build",
              - "package-dotnet",
              - "package-go",
              - "package-java",
              - "package-js",
              - "package-python",
            ] -> null
          - strict   = true -> null
        }
    }

  # github_branch_protection.reposofficialnew_cdktfproviderconsul_repositorysetup_mainprotection_0FD965B5 will be created
  + resource "github_branch_protection" "reposofficialnew_cdktfproviderconsul_repositorysetup_mainprotection_0FD965B5" {
      + allows_deletions       = false
      + allows_force_pushes    = false
      + enforce_admins         = true
      + id                     = (known after apply)
      + pattern                = "main"
      + repository_id          = "cdktf-provider-consul"
      + require_signed_commits = false

      + required_status_checks {
          + contexts = [
              + "build",
              + "package-dotnet",
              + "package-go",
              + "package-java",
              + "package-js",
              + "package-python",
            ]
          + strict   = true
        }
    }

  # github_branch_protection.reposofficialnew_cdktfproviderdns_mainprotection_4F44BC51 will be destroyed
  # (because github_branch_protection.reposofficialnew_cdktfproviderdns_mainprotection_4F44BC51 is not in configuration)
  - resource "github_branch_protection" "reposofficialnew_cdktfproviderdns_mainprotection_4F44BC51" {
      - allows_deletions       = false -> null
      - allows_force_pushes    = false -> null
      - enforce_admins         = true -> null
      - id                     = "BPR_kwDOIIyxt84Bw3U5" -> null
      - pattern                = "main" -> null
      - push_restrictions      = [] -> null
      - repository_id          = "cdktf-provider-dns" -> null
      - require_signed_commits = false -> null

      - required_status_checks {
          - contexts = [
              - "build",
              - "package-dotnet",
              - "package-go",
              - "package-java",
              - "package-js",
              - "package-python",
            ] -> null
          - strict   = true -> null
        }
    }

  # github_branch_protection.reposofficialnew_cdktfproviderdns_repositorysetup_mainprotection_29DCB0B4 will be created
  + resource "github_branch_protection" "reposofficialnew_cdktfproviderdns_repositorysetup_mainprotection_29DCB0B4" {
      + allows_deletions       = false
      + allows_force_pushes    = false
      + enforce_admins         = true
      + id                     = (known after apply)
      + pattern                = "main"
      + repository_id          = "cdktf-provider-dns"
      + require_signed_commits = false

      + required_status_checks {
          + contexts = [
              + "build",
              + "package-dotnet",
              + "package-go",
              + "package-java",
              + "package-js",
              + "package-python",
            ]
          + strict   = true
        }
    }

  # github_branch_protection.reposofficialnew_cdktfprovidergoogleworkspace_mainprotection_2A3CAAD9 will be destroyed
  # (because github_branch_protection.reposofficialnew_cdktfprovidergoogleworkspace_mainprotection_2A3CAAD9 is not in configuration)
  - resource "github_branch_protection" "reposofficialnew_cdktfprovidergoogleworkspace_mainprotection_2A3CAAD9" {
      - allows_deletions       = false -> null
      - allows_force_pushes    = false -> null
      - enforce_admins         = true -> null
      - id                     = "BPR_kwDOIIyyfc4Bw3Vj" -> null
      - pattern                = "main" -> null
      - push_restrictions      = [] -> null
      - repository_id          = "cdktf-provider-googleworkspace" -> null
      - require_signed_commits = false -> null

      - required_status_checks {
          - contexts = [
              - "build",
              - "package-dotnet",
              - "package-go",
              - "package-java",
              - "package-js",
              - "package-python",
            ] -> null
          - strict   = true -> null
        }
    }

  # github_branch_protection.reposofficialnew_cdktfprovidergoogleworkspace_repositorysetup_mainprotection_5296EBDE will be created
  + resource "github_branch_protection" "reposofficialnew_cdktfprovidergoogleworkspace_repositorysetup_mainprotection_5296EBDE" {
      + allows_deletions       = false
      + allows_force_pushes    = false
      + enforce_admins         = true
      + id                     = (known after apply)
      + pattern                = "main"
      + repository_id          = "cdktf-provider-googleworkspace"
      + require_signed_commits = false

      + required_status_checks {
          + contexts = [
              + "build",
              + "package-dotnet",
              + "package-go",
              + "package-java",
              + "package-js",
              + "package-python",
            ]
          + strict   = true
        }
    }

  # github_branch_protection.reposofficialnew_cdktfproviderhcp_mainprotection_098A956F will be destroyed
  # (because github_branch_protection.reposofficialnew_cdktfproviderhcp_mainprotection_098A956F is not in configuration)
  - resource "github_branch_protection" "reposofficialnew_cdktfproviderhcp_mainprotection_098A956F" {
      - allows_deletions       = false -> null
      - allows_force_pushes    = false -> null
      - enforce_admins         = true -> null
      - id                     = "BPR_kwDOIIy2jc4Bw3WE" -> null
      - pattern                = "main" -> null
      - push_restrictions      = [] -> null
      - repository_id          = "cdktf-provider-hcp" -> null
      - require_signed_commits = false -> null

      - required_status_checks {
          - contexts = [
              - "build",
              - "package-dotnet",
              - "package-go",
              - "package-java",
              - "package-js",
              - "package-python",
            ] -> null
          - strict   = true -> null
        }
    }

  # github_branch_protection.reposofficialnew_cdktfproviderhcp_repositorysetup_mainprotection_2F3985BD will be created
  + resource "github_branch_protection" "reposofficialnew_cdktfproviderhcp_repositorysetup_mainprotection_2F3985BD" {
      + allows_deletions       = false
      + allows_force_pushes    = false
      + enforce_admins         = true
      + id                     = (known after apply)
      + pattern                = "main"
      + repository_id          = "cdktf-provider-hcp"
      + require_signed_commits = false

      + required_status_checks {
          + contexts = [
              + "build",
              + "package-dotnet",
              + "package-go",
              + "package-java",
              + "package-js",
              + "package-python",
            ]
          + strict   = true
        }
    }

  # github_branch_protection.reposofficialnew_cdktfproviderhcs_mainprotection_BE7A3AD5 will be destroyed
  # (because github_branch_protection.reposofficialnew_cdktfproviderhcs_mainprotection_BE7A3AD5 is not in configuration)
  - resource "github_branch_protection" "reposofficialnew_cdktfproviderhcs_mainprotection_BE7A3AD5" {
      - allows_deletions       = false -> null
      - allows_force_pushes    = false -> null
      - enforce_admins         = true -> null
      - id                     = "BPR_kwDOIIy5dc4Bw3W5" -> null
      - pattern                = "main" -> null
      - push_restrictions      = [] -> null
      - repository_id          = "cdktf-provider-hcs" -> null
      - require_signed_commits = false -> null

      - required_status_checks {
          - contexts = [
              - "build",
              - "package-dotnet",
              - "package-go",
              - "package-java",
              - "package-js",
              - "package-python",
            ] -> null
          - strict   = true -> null
        }
    }

  # github_branch_protection.reposofficialnew_cdktfproviderhcs_repositorysetup_mainprotection_41480D25 will be created
  + resource "github_branch_protection" "reposofficialnew_cdktfproviderhcs_repositorysetup_mainprotection_41480D25" {
      + allows_deletions       = false
      + allows_force_pushes    = false
      + enforce_admins         = true
      + id                     = (known after apply)
      + pattern                = "main"
      + repository_id          = "cdktf-provider-hcs"
      + require_signed_commits = false

      + required_status_checks {
          + contexts = [
              + "build",
              + "package-dotnet",
              + "package-go",
              + "package-java",
              + "package-js",
              + "package-python",
            ]
          + strict   = true
        }
    }

  # github_branch_protection.reposofficialnew_cdktfproviderhttp_mainprotection_151E1F37 will be destroyed
  # (because github_branch_protection.reposofficialnew_cdktfproviderhttp_mainprotection_151E1F37 is not in configuration)
  - resource "github_branch_protection" "reposofficialnew_cdktfproviderhttp_mainprotection_151E1F37" {
      - allows_deletions       = false -> null
      - allows_force_pushes    = false -> null
      - enforce_admins         = true -> null
      - id                     = "BPR_kwDOIIyyU84Bw3Vc" -> null
      - pattern                = "main" -> null
      - push_restrictions      = [] -> null
      - repository_id          = "cdktf-provider-http" -> null
      - require_signed_commits = false -> null

      - required_status_checks {
          - contexts = [
              - "build",
              - "package-dotnet",
              - "package-go",
              - "package-java",
              - "package-js",
              - "package-python",
            ] -> null
          - strict   = true -> null
        }
    }

  # github_branch_protection.reposofficialnew_cdktfproviderhttp_repositorysetup_mainprotection_B33863E9 will be created
  + resource "github_branch_protection" "reposofficialnew_cdktfproviderhttp_repositorysetup_mainprotection_B33863E9" {
      + allows_deletions       = false
      + allows_force_pushes    = false
      + enforce_admins         = true
      + id                     = (known after apply)
      + pattern                = "main"
      + repository_id          = "cdktf-provider-http"
      + require_signed_commits = false

      + required_status_checks {
          + contexts = [
              + "build",
              + "package-dotnet",
              + "package-go",
              + "package-java",
              + "package-js",
              + "package-python",
            ]
          + strict   = true
        }
    }

  # github_branch_protection.reposofficialnew_cdktfprovidernomad_mainprotection_F8C1513D will be destroyed
  # (because github_branch_protection.reposofficialnew_cdktfprovidernomad_mainprotection_F8C1513D is not in configuration)
  - resource "github_branch_protection" "reposofficialnew_cdktfprovidernomad_mainprotection_F8C1513D" {
      - allows_deletions       = false -> null
      - allows_force_pushes    = false -> null
      - enforce_admins         = true -> null
      - id                     = "BPR_kwDOIIy2os4Bw3Wa" -> null
      - pattern                = "main" -> null
      - push_restrictions      = [] -> null
      - repository_id          = "cdktf-provider-nomad" -> null
      - require_signed_commits = false -> null

      - required_status_checks {
          - contexts = [
              - "build",
              - "package-dotnet",
              - "package-go",
              - "package-java",
              - "package-js",
              - "package-python",
            ] -> null
          - strict   = true -> null
        }
    }

  # github_branch_protection.reposofficialnew_cdktfprovidernomad_repositorysetup_mainprotection_13C0DCFB will be created
  + resource "github_branch_protection" "reposofficialnew_cdktfprovidernomad_repositorysetup_mainprotection_13C0DCFB" {
      + allows_deletions       = false
      + allows_force_pushes    = false
      + enforce_admins         = true
      + id                     = (known after apply)
      + pattern                = "main"
      + repository_id          = "cdktf-provider-nomad"
      + require_signed_commits = false

      + required_status_checks {
          + contexts = [
              + "build",
              + "package-dotnet",
              + "package-go",
              + "package-java",
              + "package-js",
              + "package-python",
            ]
          + strict   = true
        }
    }

  # github_branch_protection.reposofficialnew_cdktfprovideropc_mainprotection_11D8378A will be destroyed
  # (because github_branch_protection.reposofficialnew_cdktfprovideropc_mainprotection_11D8378A is not in configuration)
  - resource "github_branch_protection" "reposofficialnew_cdktfprovideropc_mainprotection_11D8378A" {
      - allows_deletions       = false -> null
      - allows_force_pushes    = false -> null
      - enforce_admins         = true -> null
      - id                     = "BPR_kwDOIIy5Us4Bw3Wo" -> null
      - pattern                = "main" -> null
      - push_restrictions      = [] -> null
      - repository_id          = "cdktf-provider-opc" -> null
      - require_signed_commits = false -> null

      - required_status_checks {
          - contexts = [
              - "build",
              - "package-dotnet",
              - "package-go",
              - "package-java",
              - "package-js",
              - "package-python",
            ] -> null
          - strict   = true -> null
        }
    }

  # github_branch_protection.reposofficialnew_cdktfprovideropc_repositorysetup_mainprotection_010523D3 will be created
  + resource "github_branch_protection" "reposofficialnew_cdktfprovideropc_repositorysetup_mainprotection_010523D3" {
      + allows_deletions       = false
      + allows_force_pushes    = false
      + enforce_admins         = true
      + id                     = (known after apply)
      + pattern                = "main"
      + repository_id          = "cdktf-provider-opc"
      + require_signed_commits = false

      + required_status_checks {
          + contexts = [
              + "build",
              + "package-dotnet",
              + "package-go",
              + "package-java",
              + "package-js",
              + "package-python",
            ]
          + strict   = true
        }
    }

  # github_branch_protection.reposofficialnew_cdktfprovideroraclepaas_mainprotection_DF4CD304 will be destroyed
  # (because github_branch_protection.reposofficialnew_cdktfprovideroraclepaas_mainprotection_DF4CD304 is not in configuration)
  - resource "github_branch_protection" "reposofficialnew_cdktfprovideroraclepaas_mainprotection_DF4CD304" {
      - allows_deletions       = false -> null
      - allows_force_pushes    = false -> null
      - enforce_admins         = true -> null
      - id                     = "BPR_kwDOIIy5EM4Bw3Wc" -> null
      - pattern                = "main" -> null
      - push_restrictions      = [] -> null
      - repository_id          = "cdktf-provider-oraclepaas" -> null
      - require_signed_commits = false -> null

      - required_status_checks {
          - contexts = [
              - "build",
              - "package-dotnet",
              - "package-go",
              - "package-java",
              - "package-js",
              - "package-python",
            ] -> null
          - strict   = true -> null
        }
    }

  # github_branch_protection.reposofficialnew_cdktfprovideroraclepaas_repositorysetup_mainprotection_8A38A381 will be created
  + resource "github_branch_protection" "reposofficialnew_cdktfprovideroraclepaas_repositorysetup_mainprotection_8A38A381" {
      + allows_deletions       = false
      + allows_force_pushes    = false
      + enforce_admins         = true
      + id                     = (known after apply)
      + pattern                = "main"
      + repository_id          = "cdktf-provider-oraclepaas"
      + require_signed_commits = false

      + required_status_checks {
          + contexts = [
              + "build",
              + "package-dotnet",
              + "package-go",
              + "package-java",
              + "package-js",
              + "package-python",
            ]
          + strict   = true
        }
    }

  # github_branch_protection.reposofficialnew_cdktfprovidersalesforce_mainprotection_12EB77D3 will be destroyed
  # (because github_branch_protection.reposofficialnew_cdktfprovidersalesforce_mainprotection_12EB77D3 is not in configuration)
  - resource "github_branch_protection" "reposofficialnew_cdktfprovidersalesforce_mainprotection_12EB77D3" {
      - allows_deletions       = false -> null
      - allows_force_pushes    = false -> null
      - enforce_admins         = true -> null
      - id                     = "BPR_kwDOIIy2Mc4Bw3V3" -> null
      - pattern                = "main" -> null
      - push_restrictions      = [] -> null
      - repository_id          = "cdktf-provider-salesforce" -> null
      - require_signed_commits = false -> null

      - required_status_checks {
          - contexts = [
              - "build",
              - "package-dotnet",
              - "package-go",
              - "package-java",
              - "package-js",
              - "package-python",
            ] -> null
          - strict   = true -> null
        }
    }

  # github_branch_protection.reposofficialnew_cdktfprovidersalesforce_repositorysetup_mainprotection_DE212A5B will be created
  + resource "github_branch_protection" "reposofficialnew_cdktfprovidersalesforce_repositorysetup_mainprotection_DE212A5B" {
      + allows_deletions       = false
      + allows_force_pushes    = false
      + enforce_admins         = true
      + id                     = (known after apply)
      + pattern                = "main"
      + repository_id          = "cdktf-provider-salesforce"
      + require_signed_commits = false

      + required_status_checks {
          + contexts = [
              + "build",
              + "package-dotnet",
              + "package-go",
              + "package-java",
              + "package-js",
              + "package-python",
            ]
          + strict   = true
        }
    }

  # github_branch_protection.reposofficialnew_cdktfprovidervsphere_mainprotection_414A682D will be destroyed
  # (because github_branch_protection.reposofficialnew_cdktfprovidervsphere_mainprotection_414A682D is not in configuration)
  - resource "github_branch_protection" "reposofficialnew_cdktfprovidervsphere_mainprotection_414A682D" {
      - allows_deletions       = false -> null
      - allows_force_pushes    = false -> null
      - enforce_admins         = true -> null
      - id                     = "BPR_kwDOIIyyHM4Bw3VW" -> null
      - pattern                = "main" -> null
      - push_restrictions      = [] -> null
      - repository_id          = "cdktf-provider-vsphere" -> null
      - require_signed_commits = false -> null

      - required_status_checks {
          - contexts = [
              - "build",
              - "package-dotnet",
              - "package-go",
              - "package-java",
              - "package-js",
              - "package-python",
            ] -> null
          - strict   = true -> null
        }
    }

  # github_branch_protection.reposofficialnew_cdktfprovidervsphere_repositorysetup_mainprotection_28589C45 will be created
  + resource "github_branch_protection" "reposofficialnew_cdktfprovidervsphere_repositorysetup_mainprotection_28589C45" {
      + allows_deletions       = false
      + allows_force_pushes    = false
      + enforce_admins         = true
      + id                     = (known after apply)
      + pattern                = "main"
      + repository_id          = "cdktf-provider-vsphere"
      + require_signed_commits = false

      + required_status_checks {
          + contexts = [
              + "build",
              + "package-dotnet",
              + "package-go",
              + "package-java",
              + "package-js",
              + "package-python",
            ]
          + strict   = true
        }
    }

  # github_issue_label.reposofficialnew_cdktfproviderad_automergelabel_FD838912 will be destroyed
  # (because github_issue_label.reposofficialnew_cdktfproviderad_automergelabel_FD838912 is not in configuration)
  - resource "github_issue_label" "reposofficialnew_cdktfproviderad_automergelabel_FD838912" {
      - color      = "5DC8DB" -> null
      - etag       = "W/\"97d0ee643a1041f8e95ff346536a6be678b8f226b6bb47c18b07d78e7fd7a133\"" -> null
      - id         = "cdktf-provider-ad:automerge" -> null
      - name       = "automerge" -> null
      - repository = "cdktf-provider-ad" -> null
      - url        = "https://api.github.com/repos/cdktf/cdktf-provider-ad/labels/automerge" -> null
    }

  # github_issue_label.reposofficialnew_cdktfproviderad_repositorysetup_automergelabel_CF70438D will be created
  + resource "github_issue_label" "reposofficialnew_cdktfproviderad_repositorysetup_automergelabel_CF70438D" {
      + color      = "5DC8DB"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "automerge"
      + repository = "cdktf-provider-ad"
      + url        = (known after apply)
    }

  # github_issue_label.reposofficialnew_cdktfprovideradgo_automergelabel_DB93AA7B will be destroyed
  # (because github_issue_label.reposofficialnew_cdktfprovideradgo_automergelabel_DB93AA7B is not in configuration)
  - resource "github_issue_label" "reposofficialnew_cdktfprovideradgo_automergelabel_DB93AA7B" {
      - color      = "5DC8DB" -> null
      - etag       = "W/\"2b6d0c74dc8f0623d20ce9396ce1b51f4045060474f7e155f4ca95329a5b9c35\"" -> null
      - id         = "cdktf-provider-ad-go:automerge" -> null
      - name       = "automerge" -> null
      - repository = "cdktf-provider-ad-go" -> null
      - url        = "https://api.github.com/repos/cdktf/cdktf-provider-ad-go/labels/automerge" -> null
    }

  # github_issue_label.reposofficialnew_cdktfprovideradgo_repositorysetup_automergelabel_A29240F0 will be created
  + resource "github_issue_label" "reposofficialnew_cdktfprovideradgo_repositorysetup_automergelabel_A29240F0" {
      + color      = "5DC8DB"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "automerge"
      + repository = "cdktf-provider-ad-go"
      + url        = (known after apply)
    }

  # github_issue_label.reposofficialnew_cdktfproviderazurestack_automergelabel_3FAB6D7D will be destroyed
  # (because github_issue_label.reposofficialnew_cdktfproviderazurestack_automergelabel_3FAB6D7D is not in configuration)
  - resource "github_issue_label" "reposofficialnew_cdktfproviderazurestack_automergelabel_3FAB6D7D" {
      - color      = "5DC8DB" -> null
      - etag       = "W/\"5f58f6f07e4b0726367532781930899205fec2c2f016ebf298051fc343319944\"" -> null
      - id         = "cdktf-provider-azurestack:automerge" -> null
      - name       = "automerge" -> null
      - repository = "cdktf-provider-azurestack" -> null
      - url        = "https://api.github.com/repos/cdktf/cdktf-provider-azurestack/labels/automerge" -> null
    }

  # github_issue_label.reposofficialnew_cdktfproviderazurestack_repositorysetup_automergelabel_D48B3C01 will be created
  + resource "github_issue_label" "reposofficialnew_cdktfproviderazurestack_repositorysetup_automergelabel_D48B3C01" {
      + color      = "5DC8DB"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "automerge"
      + repository = "cdktf-provider-azurestack"
      + url        = (known after apply)
    }

  # github_issue_label.reposofficialnew_cdktfproviderazurestackgo_automergelabel_273CA4E8 will be destroyed
  # (because github_issue_label.reposofficialnew_cdktfproviderazurestackgo_automergelabel_273CA4E8 is not in configuration)
  - resource "github_issue_label" "reposofficialnew_cdktfproviderazurestackgo_automergelabel_273CA4E8" {
      - color      = "5DC8DB" -> null
      - etag       = "W/\"13414dbb1061c9d860466aabc26752694b57d94419d254ee64026e72c71a95a0\"" -> null
      - id         = "cdktf-provider-azurestack-go:automerge" -> null
      - name       = "automerge" -> null
      - repository = "cdktf-provider-azurestack-go" -> null
      - url        = "https://api.github.com/repos/cdktf/cdktf-provider-azurestack-go/labels/automerge" -> null
    }

  # github_issue_label.reposofficialnew_cdktfproviderazurestackgo_repositorysetup_automergelabel_73F87D25 will be created
  + resource "github_issue_label" "reposofficialnew_cdktfproviderazurestackgo_repositorysetup_automergelabel_73F87D25" {
      + color      = "5DC8DB"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "automerge"
      + repository = "cdktf-provider-azurestack-go"
      + url        = (known after apply)
    }

  # github_issue_label.reposofficialnew_cdktfproviderboundary_automergelabel_96BF691F will be destroyed
  # (because github_issue_label.reposofficialnew_cdktfproviderboundary_automergelabel_96BF691F is not in configuration)
  - resource "github_issue_label" "reposofficialnew_cdktfproviderboundary_automergelabel_96BF691F" {
      - color      = "5DC8DB" -> null
      - etag       = "W/\"0bc3fc23ae8a09f8bd5eac947b135747d42a86b2a7c2bf0f5a6972099babdcc6\"" -> null
      - id         = "cdktf-provider-boundary:automerge" -> null
      - name       = "automerge" -> null
      - repository = "cdktf-provider-boundary" -> null
      - url        = "https://api.github.com/repos/cdktf/cdktf-provider-boundary/labels/automerge" -> null
    }

  # github_issue_label.reposofficialnew_cdktfproviderboundary_repositorysetup_automergelabel_F4A6DC1C will be created
  + resource "github_issue_label" "reposofficialnew_cdktfproviderboundary_repositorysetup_automergelabel_F4A6DC1C" {
      + color      = "5DC8DB"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "automerge"
      + repository = "cdktf-provider-boundary"
      + url        = (known after apply)
    }

  # github_issue_label.reposofficialnew_cdktfproviderboundarygo_automergelabel_0EE61A6A will be destroyed
  # (because github_issue_label.reposofficialnew_cdktfproviderboundarygo_automergelabel_0EE61A6A is not in configuration)
  - resource "github_issue_label" "reposofficialnew_cdktfproviderboundarygo_automergelabel_0EE61A6A" {
      - color      = "5DC8DB" -> null
      - etag       = "W/\"f8cb56933003ce1b332884d94361c8e355ed7dbd8fd21eef75b3c235b15185e7\"" -> null
      - id         = "cdktf-provider-boundary-go:automerge" -> null
      - name       = "automerge" -> null
      - repository = "cdktf-provider-boundary-go" -> null
      - url        = "https://api.github.com/repos/cdktf/cdktf-provider-boundary-go/labels/automerge" -> null
    }

  # github_issue_label.reposofficialnew_cdktfproviderboundarygo_repositorysetup_automergelabel_113EA4E0 will be created
  + resource "github_issue_label" "reposofficialnew_cdktfproviderboundarygo_repositorysetup_automergelabel_113EA4E0" {
      + color      = "5DC8DB"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "automerge"
      + repository = "cdktf-provider-boundary-go"
      + url        = (known after apply)
    }

  # github_issue_label.reposofficialnew_cdktfproviderconsul_automergelabel_8B6BDEBC will be destroyed
  # (because github_issue_label.reposofficialnew_cdktfproviderconsul_automergelabel_8B6BDEBC is not in configuration)
  - resource "github_issue_label" "reposofficialnew_cdktfproviderconsul_automergelabel_8B6BDEBC" {
      - color      = "5DC8DB" -> null
      - etag       = "W/\"e4984fdbebc7e0748c798add9e94a1bd825621ffcef90b88c5054236fd4fc0b0\"" -> null
      - id         = "cdktf-provider-consul:automerge" -> null
      - name       = "automerge" -> null
      - repository = "cdktf-provider-consul" -> null
      - url        = "https://api.github.com/repos/cdktf/cdktf-provider-consul/labels/automerge" -> null
    }

  # github_issue_label.reposofficialnew_cdktfproviderconsul_repositorysetup_automergelabel_F9145E76 will be created
  + resource "github_issue_label" "reposofficialnew_cdktfproviderconsul_repositorysetup_automergelabel_F9145E76" {
      + color      = "5DC8DB"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "automerge"
      + repository = "cdktf-provider-consul"
      + url        = (known after apply)
    }

  # github_issue_label.reposofficialnew_cdktfproviderconsulgo_automergelabel_6F191FC6 will be destroyed
  # (because github_issue_label.reposofficialnew_cdktfproviderconsulgo_automergelabel_6F191FC6 is not in configuration)
  - resource "github_issue_label" "reposofficialnew_cdktfproviderconsulgo_automergelabel_6F191FC6" {
      - color      = "5DC8DB" -> null
      - etag       = "W/\"841bfed1512add0dcde1b8d4aee1d45dde8e4d1166f2b91953c0f402771141ee\"" -> null
      - id         = "cdktf-provider-consul-go:automerge" -> null
      - name       = "automerge" -> null
      - repository = "cdktf-provider-consul-go" -> null
      - url        = "https://api.github.com/repos/cdktf/cdktf-provider-consul-go/labels/automerge" -> null
    }

  # github_issue_label.reposofficialnew_cdktfproviderconsulgo_repositorysetup_automergelabel_1F08AA46 will be created
  + resource "github_issue_label" "reposofficialnew_cdktfproviderconsulgo_repositorysetup_automergelabel_1F08AA46" {
      + color      = "5DC8DB"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "automerge"
      + repository = "cdktf-provider-consul-go"
      + url        = (known after apply)
    }

  # github_issue_label.reposofficialnew_cdktfproviderdns_automergelabel_A5C6CC1D will be destroyed
  # (because github_issue_label.reposofficialnew_cdktfproviderdns_automergelabel_A5C6CC1D is not in configuration)
  - resource "github_issue_label" "reposofficialnew_cdktfproviderdns_automergelabel_A5C6CC1D" {
      - color      = "5DC8DB" -> null
      - etag       = "W/\"2b659693533dd4052d1821366996f6b2592bc98603638e5c999ba7b1f5a49e44\"" -> null
      - id         = "cdktf-provider-dns:automerge" -> null
      - name       = "automerge" -> null
      - repository = "cdktf-provider-dns" -> null
      - url        = "https://api.github.com/repos/cdktf/cdktf-provider-dns/labels/automerge" -> null
    }

  # github_issue_label.reposofficialnew_cdktfproviderdns_repositorysetup_automergelabel_01C7B78B will be created
  + resource "github_issue_label" "reposofficialnew_cdktfproviderdns_repositorysetup_automergelabel_01C7B78B" {
      + color      = "5DC8DB"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "automerge"
      + repository = "cdktf-provider-dns"
      + url        = (known after apply)
    }

  # github_issue_label.reposofficialnew_cdktfproviderdnsgo_automergelabel_6716107D will be destroyed
  # (because github_issue_label.reposofficialnew_cdktfproviderdnsgo_automergelabel_6716107D is not in configuration)
  - resource "github_issue_label" "reposofficialnew_cdktfproviderdnsgo_automergelabel_6716107D" {
      - color      = "5DC8DB" -> null
      - etag       = "W/\"6eb0ca6b39cef06013194236795124d96b072116971d5b74fd031f7e0bcc3b91\"" -> null
      - id         = "cdktf-provider-dns-go:automerge" -> null
      - name       = "automerge" -> null
      - repository = "cdktf-provider-dns-go" -> null
      - url        = "https://api.github.com/repos/cdktf/cdktf-provider-dns-go/labels/automerge" -> null
    }

  # github_issue_label.reposofficialnew_cdktfproviderdnsgo_repositorysetup_automergelabel_38B8A078 will be created
  + resource "github_issue_label" "reposofficialnew_cdktfproviderdnsgo_repositorysetup_automergelabel_38B8A078" {
      + color      = "5DC8DB"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "automerge"
      + repository = "cdktf-provider-dns-go"
      + url        = (known after apply)
    }

  # github_issue_label.reposofficialnew_cdktfprovidergoogleworkspace_automergelabel_F72AA85D will be destroyed
  # (because github_issue_label.reposofficialnew_cdktfprovidergoogleworkspace_automergelabel_F72AA85D is not in configuration)
  - resource "github_issue_label" "reposofficialnew_cdktfprovidergoogleworkspace_automergelabel_F72AA85D" {
      - color      = "5DC8DB" -> null
      - etag       = "W/\"d79362378386dbb30cc59cc4243a1c4aac821d900c2e87c886e1911a9c0f8eaf\"" -> null
      - id         = "cdktf-provider-googleworkspace:automerge" -> null
      - name       = "automerge" -> null
      - repository = "cdktf-provider-googleworkspace" -> null
      - url        = "https://api.github.com/repos/cdktf/cdktf-provider-googleworkspace/labels/automerge" -> null
    }

  # github_issue_label.reposofficialnew_cdktfprovidergoogleworkspace_repositorysetup_automergelabel_A1901CE2 will be created
  + resource "github_issue_label" "reposofficialnew_cdktfprovidergoogleworkspace_repositorysetup_automergelabel_A1901CE2" {
      + color      = "5DC8DB"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "automerge"
      + repository = "cdktf-provider-googleworkspace"
      + url        = (known after apply)
    }

  # github_issue_label.reposofficialnew_cdktfprovidergoogleworkspacego_automergelabel_A25FA34C will be destroyed
  # (because github_issue_label.reposofficialnew_cdktfprovidergoogleworkspacego_automergelabel_A25FA34C is not in configuration)
  - resource "github_issue_label" "reposofficialnew_cdktfprovidergoogleworkspacego_automergelabel_A25FA34C" {
      - color      = "5DC8DB" -> null
      - etag       = "W/\"d4401ebb7571f91e58be93704b29b432d4300949e95262f35769d2a7bcb010a1\"" -> null
      - id         = "cdktf-provider-googleworkspace-go:automerge" -> null
      - name       = "automerge" -> null
      - repository = "cdktf-provider-googleworkspace-go" -> null
      - url        = "https://api.github.com/repos/cdktf/cdktf-provider-googleworkspace-go/labels/automerge" -> null
    }

  # github_issue_label.reposofficialnew_cdktfprovidergoogleworkspacego_repositorysetup_automergelabel_8118AC2A will be created
  + resource "github_issue_label" "reposofficialnew_cdktfprovidergoogleworkspacego_repositorysetup_automergelabel_8118AC2A" {
      + color      = "5DC8DB"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "automerge"
      + repository = "cdktf-provider-googleworkspace-go"
      + url        = (known after apply)
    }

  # github_issue_label.reposofficialnew_cdktfproviderhcp_automergelabel_7D12FDA6 will be destroyed
  # (because github_issue_label.reposofficialnew_cdktfproviderhcp_automergelabel_7D12FDA6 is not in configuration)
  - resource "github_issue_label" "reposofficialnew_cdktfproviderhcp_automergelabel_7D12FDA6" {
      - color      = "5DC8DB" -> null
      - etag       = "W/\"e9c9b48e251b79903f382a1f96bc93609d49f7bd0a0d8701844aefac0a0096d9\"" -> null
      - id         = "cdktf-provider-hcp:automerge" -> null
      - name       = "automerge" -> null
      - repository = "cdktf-provider-hcp" -> null
      - url        = "https://api.github.com/repos/cdktf/cdktf-provider-hcp/labels/automerge" -> null
    }

  # github_issue_label.reposofficialnew_cdktfproviderhcp_repositorysetup_automergelabel_3B2D2364 will be created
  + resource "github_issue_label" "reposofficialnew_cdktfproviderhcp_repositorysetup_automergelabel_3B2D2364" {
      + color      = "5DC8DB"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "automerge"
      + repository = "cdktf-provider-hcp"
      + url        = (known after apply)
    }

  # github_issue_label.reposofficialnew_cdktfproviderhcpgo_automergelabel_1EFE93C8 will be destroyed
  # (because github_issue_label.reposofficialnew_cdktfproviderhcpgo_automergelabel_1EFE93C8 is not in configuration)
  - resource "github_issue_label" "reposofficialnew_cdktfproviderhcpgo_automergelabel_1EFE93C8" {
      - color      = "5DC8DB" -> null
      - etag       = "W/\"91ede8560da7ea9c8cb5e105be60e9ac61695a1ed50c30c381a838ae7af3139f\"" -> null
      - id         = "cdktf-provider-hcp-go:automerge" -> null
      - name       = "automerge" -> null
      - repository = "cdktf-provider-hcp-go" -> null
      - url        = "https://api.github.com/repos/cdktf/cdktf-provider-hcp-go/labels/automerge" -> null
    }

  # github_issue_label.reposofficialnew_cdktfproviderhcpgo_repositorysetup_automergelabel_37DDAC54 will be created
  + resource "github_issue_label" "reposofficialnew_cdktfproviderhcpgo_repositorysetup_automergelabel_37DDAC54" {
      + color      = "5DC8DB"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "automerge"
      + repository = "cdktf-provider-hcp-go"
      + url        = (known after apply)
    }

  # github_issue_label.reposofficialnew_cdktfproviderhcs_automergelabel_05B54EFE will be destroyed
  # (because github_issue_label.reposofficialnew_cdktfproviderhcs_automergelabel_05B54EFE is not in configuration)
  - resource "github_issue_label" "reposofficialnew_cdktfproviderhcs_automergelabel_05B54EFE" {
      - color      = "5DC8DB" -> null
      - etag       = "W/\"a1c2b9736a913fdf6121d11f4d531d2a4be143abb325a3b5865d923f5785be8a\"" -> null
      - id         = "cdktf-provider-hcs:automerge" -> null
      - name       = "automerge" -> null
      - repository = "cdktf-provider-hcs" -> null
      - url        = "https://api.github.com/repos/cdktf/cdktf-provider-hcs/labels/automerge" -> null
    }

  # github_issue_label.reposofficialnew_cdktfproviderhcs_repositorysetup_automergelabel_812C09D7 will be created
  + resource "github_issue_label" "reposofficialnew_cdktfproviderhcs_repositorysetup_automergelabel_812C09D7" {
      + color      = "5DC8DB"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "automerge"
      + repository = "cdktf-provider-hcs"
      + url        = (known after apply)
    }

  # github_issue_label.reposofficialnew_cdktfproviderhcsgo_automergelabel_B1F73736 will be destroyed
  # (because github_issue_label.reposofficialnew_cdktfproviderhcsgo_automergelabel_B1F73736 is not in configuration)
  - resource "github_issue_label" "reposofficialnew_cdktfproviderhcsgo_automergelabel_B1F73736" {
      - color      = "5DC8DB" -> null
      - etag       = "W/\"594d608a976681318e04b3c2acba44dc6849ddfa795d9b7fd83732b0d60bd984\"" -> null
      - id         = "cdktf-provider-hcs-go:automerge" -> null
      - name       = "automerge" -> null
      - repository = "cdktf-provider-hcs-go" -> null
      - url        = "https://api.github.com/repos/cdktf/cdktf-provider-hcs-go/labels/automerge" -> null
    }

  # github_issue_label.reposofficialnew_cdktfproviderhcsgo_repositorysetup_automergelabel_E2D016CE will be created
  + resource "github_issue_label" "reposofficialnew_cdktfproviderhcsgo_repositorysetup_automergelabel_E2D016CE" {
      + color      = "5DC8DB"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "automerge"
      + repository = "cdktf-provider-hcs-go"
      + url        = (known after apply)
    }

  # github_issue_label.reposofficialnew_cdktfproviderhttp_automergelabel_8A415900 will be destroyed
  # (because github_issue_label.reposofficialnew_cdktfproviderhttp_automergelabel_8A415900 is not in configuration)
  - resource "github_issue_label" "reposofficialnew_cdktfproviderhttp_automergelabel_8A415900" {
      - color      = "5DC8DB" -> null
      - etag       = "W/\"fc3de01bc24925769911289b7affe1aa3441eaf9696305dbc2c38c967704905f\"" -> null
      - id         = "cdktf-provider-http:automerge" -> null
      - name       = "automerge" -> null
      - repository = "cdktf-provider-http" -> null
      - url        = "https://api.github.com/repos/cdktf/cdktf-provider-http/labels/automerge" -> null
    }

  # github_issue_label.reposofficialnew_cdktfproviderhttp_repositorysetup_automergelabel_4C5A4CE0 will be created
  + resource "github_issue_label" "reposofficialnew_cdktfproviderhttp_repositorysetup_automergelabel_4C5A4CE0" {
      + color      = "5DC8DB"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "automerge"
      + repository = "cdktf-provider-http"
      + url        = (known after apply)
    }

  # github_issue_label.reposofficialnew_cdktfproviderhttpgo_automergelabel_236C073B will be destroyed
  # (because github_issue_label.reposofficialnew_cdktfproviderhttpgo_automergelabel_236C073B is not in configuration)
  - resource "github_issue_label" "reposofficialnew_cdktfproviderhttpgo_automergelabel_236C073B" {
      - color      = "5DC8DB" -> null
      - etag       = "W/\"1738422b1bf6ae287d155e2dcd6a091e4d39e64ff293fa20cff8d0fb17d08150\"" -> null
      - id         = "cdktf-provider-http-go:automerge" -> null
      - name       = "automerge" -> null
      - repository = "cdktf-provider-http-go" -> null
      - url        = "https://api.github.com/repos/cdktf/cdktf-provider-http-go/labels/automerge" -> null
    }

  # github_issue_label.reposofficialnew_cdktfproviderhttpgo_repositorysetup_automergelabel_9AB38B08 will be created
  + resource "github_issue_label" "reposofficialnew_cdktfproviderhttpgo_repositorysetup_automergelabel_9AB38B08" {
      + color      = "5DC8DB"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "automerge"
      + repository = "cdktf-provider-http-go"
      + url        = (known after apply)
    }

  # github_issue_label.reposofficialnew_cdktfprovidernomad_automergelabel_66BE67C4 will be destroyed
  # (because github_issue_label.reposofficialnew_cdktfprovidernomad_automergelabel_66BE67C4 is not in configuration)
  - resource "github_issue_label" "reposofficialnew_cdktfprovidernomad_automergelabel_66BE67C4" {
      - color      = "5DC8DB" -> null
      - etag       = "W/\"5103fb6bbd6bc957041abb86a84ba1dab0a2df6a48854dcc96be7a57cf347058\"" -> null
      - id         = "cdktf-provider-nomad:automerge" -> null
      - name       = "automerge" -> null
      - repository = "cdktf-provider-nomad" -> null
      - url        = "https://api.github.com/repos/cdktf/cdktf-provider-nomad/labels/automerge" -> null
    }

  # github_issue_label.reposofficialnew_cdktfprovidernomad_repositorysetup_automergelabel_3382357A will be created
  + resource "github_issue_label" "reposofficialnew_cdktfprovidernomad_repositorysetup_automergelabel_3382357A" {
      + color      = "5DC8DB"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "automerge"
      + repository = "cdktf-provider-nomad"
      + url        = (known after apply)
    }

  # github_issue_label.reposofficialnew_cdktfprovidernomadgo_automergelabel_FDBF4BF6 will be destroyed
  # (because github_issue_label.reposofficialnew_cdktfprovidernomadgo_automergelabel_FDBF4BF6 is not in configuration)
  - resource "github_issue_label" "reposofficialnew_cdktfprovidernomadgo_automergelabel_FDBF4BF6" {
      - color      = "5DC8DB" -> null
      - etag       = "W/\"7c6b343bf324c21482a51e43f0e883742af936eac6b5d08d18ae43106855b15b\"" -> null
      - id         = "cdktf-provider-nomad-go:automerge" -> null
      - name       = "automerge" -> null
      - repository = "cdktf-provider-nomad-go" -> null
      - url        = "https://api.github.com/repos/cdktf/cdktf-provider-nomad-go/labels/automerge" -> null
    }

  # github_issue_label.reposofficialnew_cdktfprovidernomadgo_repositorysetup_automergelabel_40378E32 will be created
  + resource "github_issue_label" "reposofficialnew_cdktfprovidernomadgo_repositorysetup_automergelabel_40378E32" {
      + color      = "5DC8DB"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "automerge"
      + repository = "cdktf-provider-nomad-go"
      + url        = (known after apply)
    }

  # github_issue_label.reposofficialnew_cdktfprovideropc_automergelabel_82D96786 will be destroyed
  # (because github_issue_label.reposofficialnew_cdktfprovideropc_automergelabel_82D96786 is not in configuration)
  - resource "github_issue_label" "reposofficialnew_cdktfprovideropc_automergelabel_82D96786" {
      - color      = "5DC8DB" -> null
      - etag       = "W/\"a3d30781d01ecb3738b38834cb3555d7649c7fe7a24aea9679b6a6b1d7086242\"" -> null
      - id         = "cdktf-provider-opc:automerge" -> null
      - name       = "automerge" -> null
      - repository = "cdktf-provider-opc" -> null
      - url        = "https://api.github.com/repos/cdktf/cdktf-provider-opc/labels/automerge" -> null
    }

  # github_issue_label.reposofficialnew_cdktfprovideropc_repositorysetup_automergelabel_7579D01B will be created
  + resource "github_issue_label" "reposofficialnew_cdktfprovideropc_repositorysetup_automergelabel_7579D01B" {
      + color      = "5DC8DB"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "automerge"
      + repository = "cdktf-provider-opc"
      + url        = (known after apply)
    }

  # github_issue_label.reposofficialnew_cdktfprovideropcgo_automergelabel_8E75B43A will be destroyed
  # (because github_issue_label.reposofficialnew_cdktfprovideropcgo_automergelabel_8E75B43A is not in configuration)
  - resource "github_issue_label" "reposofficialnew_cdktfprovideropcgo_automergelabel_8E75B43A" {
      - color      = "5DC8DB" -> null
      - etag       = "W/\"e02245dc930befb86bd7c8729ee0083ee3a9b1ec353e46ef98e46fc938954268\"" -> null
      - id         = "cdktf-provider-opc-go:automerge" -> null
      - name       = "automerge" -> null
      - repository = "cdktf-provider-opc-go" -> null
      - url        = "https://api.github.com/repos/cdktf/cdktf-provider-opc-go/labels/automerge" -> null
    }

  # github_issue_label.reposofficialnew_cdktfprovideropcgo_repositorysetup_automergelabel_6CB874E0 will be created
  + resource "github_issue_label" "reposofficialnew_cdktfprovideropcgo_repositorysetup_automergelabel_6CB874E0" {
      + color      = "5DC8DB"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "automerge"
      + repository = "cdktf-provider-opc-go"
      + url        = (known after apply)
    }

  # github_issue_label.reposofficialnew_cdktfprovideroraclepaas_automergelabel_D0785EE0 will be destroyed
  # (because github_issue_label.reposofficialnew_cdktfprovideroraclepaas_automergelabel_D0785EE0 is not in configuration)
  - resource "github_issue_label" "reposofficialnew_cdktfprovideroraclepaas_automergelabel_D0785EE0" {
      - color      = "5DC8DB" -> null
      - etag       = "W/\"065b5bdafa1d7c59ce61d765de154bf3bf90bb722ae8c6d8197e8132a3b2aa0d\"" -> null
      - id         = "cdktf-provider-oraclepaas:automerge" -> null
      - name       = "automerge" -> null
      - repository = "cdktf-provider-oraclepaas" -> null
      - url        = "https://api.github.com/repos/cdktf/cdktf-provider-oraclepaas/labels/automerge" -> null
    }

  # github_issue_label.reposofficialnew_cdktfprovideroraclepaas_repositorysetup_automergelabel_9D935068 will be created
  + resource "github_issue_label" "reposofficialnew_cdktfprovideroraclepaas_repositorysetup_automergelabel_9D935068" {
      + color      = "5DC8DB"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "automerge"
      + repository = "cdktf-provider-oraclepaas"
      + url        = (known after apply)
    }

  # github_issue_label.reposofficialnew_cdktfprovideroraclepaasgo_automergelabel_22E4CCC2 will be destroyed
  # (because github_issue_label.reposofficialnew_cdktfprovideroraclepaasgo_automergelabel_22E4CCC2 is not in configuration)
  - resource "github_issue_label" "reposofficialnew_cdktfprovideroraclepaasgo_automergelabel_22E4CCC2" {
      - color      = "5DC8DB" -> null
      - etag       = "W/\"f2f1f53dcf15007ec96e1f0f3fc76fbe18b903b36827c2cda9b071edc31ca60f\"" -> null
      - id         = "cdktf-provider-oraclepaas-go:automerge" -> null
      - name       = "automerge" -> null
      - repository = "cdktf-provider-oraclepaas-go" -> null
      - url        = "https://api.github.com/repos/cdktf/cdktf-provider-oraclepaas-go/labels/automerge" -> null
    }

  # github_issue_label.reposofficialnew_cdktfprovideroraclepaasgo_repositorysetup_automergelabel_392170A3 will be created
  + resource "github_issue_label" "reposofficialnew_cdktfprovideroraclepaasgo_repositorysetup_automergelabel_392170A3" {
      + color      = "5DC8DB"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "automerge"
      + repository = "cdktf-provider-oraclepaas-go"
      + url        = (known after apply)
    }

  # github_issue_label.reposofficialnew_cdktfprovidersalesforce_automergelabel_7B07BEE5 will be destroyed
  # (because github_issue_label.reposofficialnew_cdktfprovidersalesforce_automergelabel_7B07BEE5 is not in configuration)
  - resource "github_issue_label" "reposofficialnew_cdktfprovidersalesforce_automergelabel_7B07BEE5" {
      - color      = "5DC8DB" -> null
      - etag       = "W/\"c38975a0e6a79ebaa5ec1489eb01396cb5f157436e3c2292892e19302709a73f\"" -> null
      - id         = "cdktf-provider-salesforce:automerge" -> null
      - name       = "automerge" -> null
      - repository = "cdktf-provider-salesforce" -> null
      - url        = "https://api.github.com/repos/cdktf/cdktf-provider-salesforce/labels/automerge" -> null
    }

  # github_issue_label.reposofficialnew_cdktfprovidersalesforce_repositorysetup_automergelabel_87C1C631 will be created
  + resource "github_issue_label" "reposofficialnew_cdktfprovidersalesforce_repositorysetup_automergelabel_87C1C631" {
      + color      = "5DC8DB"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "automerge"
      + repository = "cdktf-provider-salesforce"
      + url        = (known after apply)
    }

  # github_issue_label.reposofficialnew_cdktfprovidersalesforcego_automergelabel_9B129D63 will be destroyed
  # (because github_issue_label.reposofficialnew_cdktfprovidersalesforcego_automergelabel_9B129D63 is not in configuration)
  - resource "github_issue_label" "reposofficialnew_cdktfprovidersalesforcego_automergelabel_9B129D63" {
      - color      = "5DC8DB" -> null
      - etag       = "W/\"d24a5212a4ced4536aa611f8a0d2f7c22bfd9fcf22de44879d085aace17ccdc5\"" -> null
      - id         = "cdktf-provider-salesforce-go:automerge" -> null
      - name       = "automerge" -> null
      - repository = "cdktf-provider-salesforce-go" -> null
      - url        = "https://api.github.com/repos/cdktf/cdktf-provider-salesforce-go/labels/automerge" -> null
    }

  # github_issue_label.reposofficialnew_cdktfprovidersalesforcego_repositorysetup_automergelabel_5B7CE2C8 will be created
  + resource "github_issue_label" "reposofficialnew_cdktfprovidersalesforcego_repositorysetup_automergelabel_5B7CE2C8" {
      + color      = "5DC8DB"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "automerge"
      + repository = "cdktf-provider-salesforce-go"
      + url        = (known after apply)
    }

  # github_issue_label.reposofficialnew_cdktfprovidervsphere_automergelabel_541DFEF2 will be destroyed
  # (because github_issue_label.reposofficialnew_cdktfprovidervsphere_automergelabel_541DFEF2 is not in configuration)
  - resource "github_issue_label" "reposofficialnew_cdktfprovidervsphere_automergelabel_541DFEF2" {
      - color      = "5DC8DB" -> null
      - etag       = "W/\"42c3c4c75329c1dddf51159b25ce5791771b1e611acdbac57d2109d6c10a8085\"" -> null
      - id         = "cdktf-provider-vsphere:automerge" -> null
      - name       = "automerge" -> null
      - repository = "cdktf-provider-vsphere" -> null
      - url        = "https://api.github.com/repos/cdktf/cdktf-provider-vsphere/labels/automerge" -> null
    }

  # github_issue_label.reposofficialnew_cdktfprovidervsphere_repositorysetup_automergelabel_0BFBB080 will be created
  + resource "github_issue_label" "reposofficialnew_cdktfprovidervsphere_repositorysetup_automergelabel_0BFBB080" {
      + color      = "5DC8DB"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "automerge"
      + repository = "cdktf-provider-vsphere"
      + url        = (known after apply)
    }

  # github_issue_label.reposofficialnew_cdktfprovidervspherego_automergelabel_631A3424 will be destroyed
  # (because github_issue_label.reposofficialnew_cdktfprovidervspherego_automergelabel_631A3424 is not in configuration)
  - resource "github_issue_label" "reposofficialnew_cdktfprovidervspherego_automergelabel_631A3424" {
      - color      = "5DC8DB" -> null
      - etag       = "W/\"f1724732219edb7e1b80e56fd06a8569f9a8210a25fee7fe696d2973861984de\"" -> null
      - id         = "cdktf-provider-vsphere-go:automerge" -> null
      - name       = "automerge" -> null
      - repository = "cdktf-provider-vsphere-go" -> null
      - url        = "https://api.github.com/repos/cdktf/cdktf-provider-vsphere-go/labels/automerge" -> null
    }

  # github_issue_label.reposofficialnew_cdktfprovidervspherego_repositorysetup_automergelabel_5D9491B1 will be created
  + resource "github_issue_label" "reposofficialnew_cdktfprovidervspherego_repositorysetup_automergelabel_5D9491B1" {
      + color      = "5DC8DB"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "automerge"
      + repository = "cdktf-provider-vsphere-go"
      + url        = (known after apply)
    }

  # github_repository_webhook.reposofficialnew_cdktfproviderad_repositorysetup_slackwebhook_39677D1D will be created
  + resource "github_repository_webhook" "reposofficialnew_cdktfproviderad_repositorysetup_slackwebhook_39677D1D" {
      + active     = true
      + etag       = (known after apply)
      + events     = [
          + "issues",
        ]
      + id         = (known after apply)
      + repository = "cdktf-provider-ad"
      + url        = (known after apply)

      + configuration {
          + content_type = "json"
          + url          = (sensitive value)
        }
    }

  # github_repository_webhook.reposofficialnew_cdktfproviderad_slackwebhook_2AD86075 will be destroyed
  # (because github_repository_webhook.reposofficialnew_cdktfproviderad_slackwebhook_2AD86075 is not in configuration)
  - resource "github_repository_webhook" "reposofficialnew_cdktfproviderad_slackwebhook_2AD86075" {
      - active     = true -> null
      - events     = [
          - "issues",
        ] -> null
      - id         = "382993115" -> null
      - repository = "cdktf-provider-ad" -> null
      - url        = "https://api.github.com/repos/cdktf/cdktf-provider-ad/hooks/382993115" -> null

      - configuration {
          - content_type = "json" -> null
          - insecure_ssl = false -> null
          - secret       = (sensitive value)
          - url          = (sensitive value)
        }
    }

  # github_repository_webhook.reposofficialnew_cdktfprovideradgo_repositorysetup_slackwebhook_6F0CF208 will be created
  + resource "github_repository_webhook" "reposofficialnew_cdktfprovideradgo_repositorysetup_slackwebhook_6F0CF208" {
      + active     = true
      + etag       = (known after apply)
      + events     = [
          + "issues",
        ]
      + id         = (known after apply)
      + repository = "cdktf-provider-ad-go"
      + url        = (known after apply)

      + configuration {
          + content_type = "json"
          + url          = (sensitive value)
        }
    }

  # github_repository_webhook.reposofficialnew_cdktfprovideradgo_slackwebhook_AB297FF7 will be destroyed
  # (because github_repository_webhook.reposofficialnew_cdktfprovideradgo_slackwebhook_AB297FF7 is not in configuration)
  - resource "github_repository_webhook" "reposofficialnew_cdktfprovideradgo_slackwebhook_AB297FF7" {
      - active     = true -> null
      - events     = [
          - "issues",
        ] -> null
      - id         = "382993253" -> null
      - repository = "cdktf-provider-ad-go" -> null
      - url        = "https://api.github.com/repos/cdktf/cdktf-provider-ad-go/hooks/382993253" -> null

      - configuration {
          - content_type = "json" -> null
          - insecure_ssl = false -> null
          - secret       = (sensitive value)
          - url          = (sensitive value)
        }
    }

  # github_repository_webhook.reposofficialnew_cdktfproviderazurestack_repositorysetup_slackwebhook_E4F6B567 will be created
  + resource "github_repository_webhook" "reposofficialnew_cdktfproviderazurestack_repositorysetup_slackwebhook_E4F6B567" {
      + active     = true
      + etag       = (known after apply)
      + events     = [
          + "issues",
        ]
      + id         = (known after apply)
      + repository = "cdktf-provider-azurestack"
      + url       ...
```

</details>

*Pusher: @DanielMSchmidt, Action: `pull_request`, Working Directory: ``, Workflow: `Plan`*